const par = document.querySelector("p");
const mainArr = [
  "الناس عديمو القيمة يعيشون ليأكلوا ويشربوا؛ والناس ذوو القيمة يأكلون ويشربون ليعيشوا.",
  "الأغنى هو من يقتنع بالقليل.",
  "دع الذي يريد أن يحرك العالم أن يحرك نفسه أولاً.",
  "ليست الحياة، بل الحياة الكريمة، لتكون على رأس الأولوية.",
  "لا تركن إلى الزمن فإنه سريع الخيانة.",
  "الملك الأعظم هو أن يغلب الإنسان شهواته.",
  "داوِ الغضب بالصمت، وداوِ الشهوة بالغضب، فإن من غضب على نفسه من تناول المساوئ شغل عنها.",
  "لا راحة لمن تعجل الراحة بكسله.",
  "الجمال هو طغيان غير دائم.",
  "حالما تتحقق المساواة بين الرجل والمرأة ، سوف تصبح المرأة قائدته.",
  "ليس المهم الحياة ذاتها ... لكن المهم أن نعيش على حق.",
  "القتلى وحدهم من يرون نهاية الحرب",
  "اتقوا الظلم فإن الظلم ظلمات يوم القيامة. ‌",
  "آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا اِئْتُمِن خان.",
  "رحم الله اِمْرَءًا اكتسب طيّبًا، وأنفق قصْدًا، وقدّم فضْلًا ليوم فقره وحاجته.",
  "ليس الشديد بالصرعة,إنما الشديد الذي يملك نفسه عند الغضب.",
  "إياكم والظن فان الظن أكذب الحديث.",
];
const x = mainArr.length;
let num;
const cenNum = () => Math.floor(Math.random() * 10 ** 6) % x;
par.addEventListener("click", function () {
  num = cenNum();
  par.innerHTML = mainArr[num];
});
