const par = document.querySelector("p");
const parCon = document.querySelector(".quaCon");
const mainArr = [
  "الناس عديمو القيمة يعيشون ليأكلوا ويشربوا؛ والناس ذوو القيمة يأكلون ويشربون ليعيشوا.",
  "الأغنى هو من يقتنع بالقليل.",
  "دع الذي يريد أن يحرك العالم أن يحرك نفسه أولاً.",
  "ليست الحياة، بل الحياة الكريمة، لتكون على رأس الأولوية.",
  "لا تركن إلى الزمن فإنه سريع الخيانة.",
  "الملك الأعظم هو أن يغلب الإنسان شهواته.",
  "داوِ الغضب بالصمت، وداوِ الشهوة بالغضب، فإن من غضب على نفسه من تناول المساوئ شغل عنها.",
  "لا راحة لمن تعجل الراحة بكسله.",
  "الجمال هو طغيان غير دائم.",
  "حالما تتحقق المساواة بين الرجل والمرأة ، سوف تصبح المرأة قائدته.",
  "ليس المهم الحياة ذاتها ... لكن المهم أن نعيش على حق.",
  "القتلى وحدهم من يرون نهاية الحرب",
  "اتقوا الظلم فإن الظلم ظلمات يوم القيامة. ‌",
  "آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا اِئْتُمِن خان.",
  "رحم الله اِمْرَءًا اكتسب طيّبًا، وأنفق قصْدًا، وقدّم فضْلًا ليوم فقره وحاجته.",
  "ليس الشديد بالصرعة,إنما الشديد الذي يملك نفسه عند الغضب.",
  "إياكم والظن فان الظن أكذب الحديث.",
  "ما ضاع امرؤ عرف قدره.",
  "ما أضمر أحد شيئاً إلاّ ظهر في فلتات لسانه، وصفحات وجهه.",
  "الصَّبْرُ صَبْرَانِ: صَبْرٌ عَلَى مَا تَكْرَهُ، وَصَبْرٌ عَمَّا تُحِبُّ",
  "خير المال ما أغناك وخير منه ما كفاك. خير أصحابك من واسآك وخير منه من كفاك شـره.",
  "استغنِ عمن شئت تكن نظيره , وأحتج إلى من شئت تكن أسيره , وأحسن إلى من شئت تكن أميره .",
  "فَاعِلُ الْخَيْرِ خَيْرٌ مِنْهُ، وَفَاعِلُ الشَّرِّ شَرٌّ مِنْهُ.",
  "مَنْ كَرُمَتْ عَلَيْهِ نَفْسُهُ هَانَتْ عَلَيْهِ شَهْوَتُهُ",
  "النَّاسُ أَعْدَاءُ مَا جَهِلُوا",
  "أعداؤك ثلاثة: عدوك ,وصديق عدوك ,وعدو صديقك .",
  "خَالِطُوا النَّاسَ مُخَالَطَةً إِنْ مِتُّمْ مَعَهَا بَكَوْا عَلَيْكُمْ، وَإِنْ عِشْتُمْ حَنُّوا إِلَيْكُمْ.",
  "من أراد أن يطاع فعليه أن يعرف كيف يأمر. ",
  "إذا كان لا مفر من أذية أحد فلتؤذه بقسوة تجعلك لا تخاف من انتقامه. ",
  "ولدت فقيراً فتعلمت الحاجة قبل المتعة. ",
  "المنتصر أصدقاؤه كثيرون، والمنهزم أصدقاؤه حقيقيون. ",
  "الغاية تبرر الوسيلة. ",
  "لا تتوقف عن الابتسام حتى وإن كنت حزينا فلربما فتن أحد بابتسامتك. ",
  "لا أحد يستحق دموعك، ولئن استحقها أحد فلن يدعك تذرفها. ",
  "لا أنا لست رجل غني، أنا رجل فقير يمتلك مال وهذا ليس نفس الشيء. ",
  "يجب أن نقرأ فقط الكتب التي تجبرنا على أن نعيد قراءتها. ",
  "إذا لم يكن هناك الله، فكل شيء مستباح",
  "الروح تشفى بالبقاء مع الأطفال",
  "عشقت ذنوبي عندما رأيت إيمانكم المزيف ",
  "الزهور الي ستشتريها عند زيارتك لقبري، لا داعٍ لها و لا داعي أن تبكي فوق رأسي، إشتري ساندويش و اعطه لحارس المقبرة",
  "لن يثوروا حتى يعوا ولن يعوا حتى يثوروا .",
  " الرجل الذي يرى العالم وهو في الخمسين بنفس النظرة كما كان في عمر العشرين يكون ضيع ثلاثين عاما بلا فائدة",
  " من لايجرأ على مخاطرة لن يحقق شيئا في حياته",
  "خدمتك للاخرين هو الايجار الذي تدفعه مقابل سكنك في الدنيا",
  "لمنتصر لن يسأل عما إذا كان يقول الحقيقة أم لا.",
  "إذا لم تعلم أين تذهب فأي طريق تفي بالغرض.",
  "إن الفقر هو أحد أضلاع المثلث الشهير الذي يضم معه المرض والجهل فإذا تجلى هذا المثلث الثلاثي الاضلاع في مكان ما تأكد أن الشعب - أي شعب - مهما كانت حضارته وعراقته سوف يكفر بالدولة وآلياتها ونظامها ولسوف تنتحر القيم الوطنية داخل كل إنسان.",
  "الأكثرية الجاهلة هي التي تتحكم بالبلاد وذلك بفضل ما يدعى بنظام الإقتراع العام.",
  "يمكن أن تخدع كل الناس بعض الوقت، وبعض الناس كل الوقت، لكنك لن تستطيع خداع كل الناس كل الوقت.",
  "استمتع بالأشياء الصغيرة، فقد يأتي اليوم الذي تدرك فيه أنها كانت الأشياء الكبيرة.",
  "إني أعمل دائماً ما لا أستطيع عمله، لكي أتعلم كيفية عمله "

];
const x = mainArr.length;
let num;
const cenNum = () => Math.floor(Math.random() * 10 ** 6) % x;
parCon.addEventListener("click", function () {
  num = cenNum();
  par.innerHTML = mainArr[num];
});
